Repository: kkcjy/Translator
Catalog: model/OPUS-MT-train/finetune/VNK-Hallituksen_vuosikertomus.tmx
Source language: fi_fi
Languages: sv_se

source: Hankkeessa vastaanoton kokonaiskustannuksia pyrittiin sopeuttamaan hakijoiden määrää ja käsittelyaikojen lyhenemistä vastaavasti.
sv_se: Genom projektet strävade man efter att anpassa de totala kostnaderna för mottagandet till antalet sökande och kortare handläggningstider.

source: Hankkeen aikana turvapaikkaprosessi tehostui ja turvapaikkahakemusten käsittelyajat lyhenivät keskimäärin kolmella kuukaudella (v. 2011: 263 vrk, v. 2014:170 vrk).
sv_se: Medan projektet pågick blev asylprocessen effektivare, och handläggningstiderna för asylansökningar förkortades med i genomsnitt tre månader (år 2011: 263 dygn, år 2014:170 dygn).

source: Turvapaikanhakijamäärät olivat kesään 2015 tultaessa useita vuosia n. 3000–4000 hakijan vuotuisella tasolla.
sv_se: Antalet asylsökande hade när sommaren 2015 kom flera år uppgått till cirka 3 000–4 000 sökande per år.

source: 1.9.2011 voimaan tulleessa laissa kotoutumisen edistämisestä (1386/2010, kotoutumislaki) säädetään maahanmuuttajan kotoutumista edistävistä toimenpiteistä siten, että ne muodostavat johdonmukaisen kokonaisuuden.
sv_se: I den lag om främjande av integration (1386/2010, integrationslagen) som trädde i kraft 1.9.2011 föreskrivs om åtgärder som främjar invandrares integration så att de bildar en följdriktig helhet.

source: Kotoutumisen ja työllistymisen nopeuttamiseksi laissa säädetään kotoutumisen alkuvaiheen palveluista, kuten kaikille annettavasta perustiedosta, ohjauksesta ja neuvonnasta, alkukartoituksesta, alkukartoituksen perusteella laadittavasta kotoutumissuunnitelmasta ja kotoutumiskoulutuksesta.
sv_se: I syfte att påskynda integration och sysselsättning finns det i lagen bestämmelser om tjänster för nyanlända, såsom basinformation, vägledning och rådgivning till alla, inledande kartläggning, den integrationsplan som ska upprättas utifrån den inledande kartläggningen och integrationsutbildning.

source: Perustieto sisältää myös tietoa mahdollisuudesta osallistua alkukartoitukseen ja muihin kotoutumista edistäviin toimenpiteisiin.
sv_se: Basinformationen ska också innehålla information om möjligheten att delta i en inledande kartläggning och i andra integrationsfrämjande åtgärder.

source: Perustietoaineisto ja alkukartoitus ovat 1.9.2011 voimaan tulleessa kotoutumislaissa uusia toimenpiteitä.
sv_se: Basinformationsmaterialet och den inledande kartläggningen är nya åtgärder i den integrationslag som trädde i kraft 1.9.2011.

source: Perustietoaineisto on valmisteltu Euroopan sosiaalirahaston rahoituksella.
sv_se: Basinformationsmaterialet har utarbetats med finansiering från Europeiska socialfonden.

source: Aineistoa myös kehitetty edelleen vuonna 2013 Euroopan sosiaalirahaston rahoituksella, johon vuoden 2014 talousarviosta perustietoaineiston päivittäminen ja jakeluun on varattu määrärahan valtion talousarviossa.
sv_se: Materialet har också vidareutvecklats 2013 med finansiering från Europeiska socialfonden, och i statsbudgeten för 2014 har reserverats anslag för uppdateringen och distributionen av basinformationsmaterialet.

source: Kotoutumislain säädös alkukartoituksesta on uusi, mutta alkukartoituksia on tehty osana työvoimapoliittista kotoutumiskoulutusta Opetushallituksen opetussuunnitelmasuosituksen mukaisesti.
sv_se: Integrationslagens bestämmelse om inledande kartläggning är ny, men inledande kartläggningar har gjorts som en del av arbetskraftspolitisk integrationsutbildning i enlighet med Utbildningsstyrelsens läroplansrekommendation.

source: Työ- ja elinkeinotoimisto laatii alkukartoituksen työnhakijaksi rekisteröityneille ja ne rahoitetaan työ- ja elinkeinoministeriön pääluokasta momentilta 32.30.51, Työllistämis-, koulutus- ja erityistoimet.
sv_se: Arbets- och näringsbyrån ska göra en inledande kartläggning för dem som är registrerade som arbetssökande. De inledande kartläggningarna finansieras med anslag under arbets- och näringsministeriets huvudtitel under moment 32.30.51, Sysselsättnings- och utbildningsåtgärder samt speciella åtgärder.

source: Kunta laatii alkukartoituksen toimeentulotukiasiakkaille ja sitä pyytäville muille maahanmuuttajille.
sv_se: Kommunen ska göra den inledande kartläggningen för de klienter som får utkomststöd och för andra invandrare som begär det.

source: Valtion korvaa kunnille alkukartoituksen laatimisesta aiheutuneet kustannukset laskennallisena korvauksena.
sv_se: Staten betalar kommunerna en kalkylerad ersättning för kostnaderna för ordnandet av den inledande kartläggningen.

source: Tarkoitukseen on varattu määräraha työ- ja elinkeinoministeriön pääluokassa momentilla 32.70.30, Kunnille maksettavat korvaukset Kotoutumislain 45 §:n mukaisesti kunnille kansainvälistä suojelua saavista maksettavien laskennallisten korvausten tasoa nostettiin 1.1.2011 lukien 10 %.
sv_se: För detta ändamål har ett anslag reserverats under arbets- och näringsministeriets huvudtitel under moment 32.70.30, Statlig ersättning till kommunerna. I enlighet med 45 § i integrationslagen höjdes nivån på den kalkylerade ersättning som betalas till kommunerna i fråga om personer som får internationellt skydd med 10 procent 1.1.2011.

source: Uudessa kotoutumislaissa korvausaikaa pidennettiin kolmesta vuodesta neljään vuoteen kiintiöpakolaisten osalta.
sv_se: I den nya integrationslagen förlängdes ersättningstiden från tre år till fyra år när det gäller kvotflyktingar.

source: Hallitus antoi hallintovaliokunnalle selvityksen alkuvuodesta 2012.
sv_se: Regeringen lämnade förvaltningsutskottet en utredning i början av 2012.

source: "Perustietoaineiston omaksumisesta Suomen kansalaisuuden edellytyksenä hallituksen selvityksessä viitataan sisäasiainministeriössä kansalaisuuslain muutostarpeista tehtyyn selvitykseen.
sv_se: ”I regeringens utredning om det för dem som söker finskt medborgarskap ska ställas som villkor att de har lärt sig basinformationen hänvisas det till inrikesministeriets utredning om behoven av en revidering av medborgarskapslagen.

source: Selvitystä käytettiin valmistelun pohjana kansalaisuuslain uudistusta valmisteltaessa.
sv_se: Utredningen användes som underlag vid beredningen av lagen om ändring av medborgarskapslagen.

source: Eduskunta hyväksyi lakiesityksen 19.1.2011 (579/2011).
sv_se: Lagförslaget godkändes av riksdagen 19.1.2011 (579/2011).

source: Sisäasiainministeriön selvityksessä otettiin kantaa myös testien merkitykseen Suomen kansalaisuuden myöntämisen edellytyksenä sekä muun muassa tarkasteltiin kansainvälisiä käytäntöjä.
sv_se: I inrikesministeriets utredning tog man också ställning till testets betydelse som villkor för finskt medborgarskap samt bland annat granskade internationell praxis.

source: Selvityksen johtopäätöksenä omaksuttiin lähtökohta, jonka mukaan mahdollisuus saada Suomen kansalaisuus tukee maahanmuuttajan kotoutumista ja yhteiskunnallisen yhteenkuuluvuuden tunnetta.
sv_se: Som slutsats i utredningen gick man in för principen att möjligheten att beviljas finskt medborgarskap främjar invandrarens integration och känsla av samhällstillhörighet.

source: Tästä syystä hallituksen esitykseen ei sisällytetty yhteiskunta- ja historiatietoutta tai arvoja mittaavia testejä.
sv_se: I regeringspropositionen föreslogs av denna anledning inte några tester som mäter samhälls- eller historiekunskaper eller värderingar.

source: Tämänkaltaisten testien ei nähty toimivan maahanmuuttajan yksilöllisen kotoutumisprosessin tukena.
sv_se: Sådana tester ansågs inte stöda invandrarnas individuella integreringsprocess.

source: Lisäksi testiin liittyvät hallinnolliset, oikeudelliset, pedagogiset ja hakijoiden yhdenvertaisuuteen liittyvät kysymykset eivät sisäasiainministeriön näkemyksen mukaan tukeneet testin käyttöönottoa Suomessa."
sv_se: Enligt inrikesministeriets åsikt stödde inte heller de administrativa, rättsliga och pedagogiska frågorna eller jämlikhetsfrågorna i anslutning till testet ibruktagande av testet i Finland.”

source: Kotoutumislain (1386/2010) valmistelussa tarkasteltiin erilaisia mahdollisuuksia tukea maahanmuuttajaa kotoutumiskoulutuksen aikana.
sv_se: I beredningen av integrationslagen (1386/2010) granskades olika möjligheter att stödja invandrare under integrationsutbildningen.

source: Valitussa perusratkaisussa kotoutumistuki on useimmiten sidottu työmarkkinatukeen, ja sen pohjalla olevaan lainsäädäntöön.
sv_se: När det gäller de grundläggande lösningar som valdes är integrationsstödet i de flesta fall bundet till arbetsmarknadsstödet och till den lagstiftning som ligger till grund för arbetsmarknadsstödet.

source: Työvoimaan kuulumattomien osalta kotoutumistuki voi olla sidottu toimeentulotukeen.
sv_se: I fråga om dem som inte står till förfogande för arbetsmarknaden kan integrationsstödet vara bundet till utkomststödet.

source: Työmarkkinatuen maksaminen kotoutumistukena edellyttää, että maahanmuuttajan ensimmäinen kotikunta Suomessa on merkitty väestötietojärjestelmään ja että hän noudattaa kotoutumissuunnitelmaa.
sv_se: För att arbetsmarknadsstöd ska betalas i form av integrationsstöd förutsätts att invandrarens första hemkommun i Finland har registrerats i befolkningsdatasystemet och att invandraren iakttar integrationsplanen.

source: Lisäksi edellytetään, että maahanmuuttaja on taloudellisen tuen tarpeessa ja täyttää muutoinkin työmarkkinatuen saamisen edellytykset.
sv_se: Vidare förutsätts att invandraren är i behov av ekonomiskt stöd och även i övrigt uppfyller villkoren för arbetsmarknadsstöd.

source: Kotoutumistukena maksettavaan työmarkkinatukeen sovelletaan samoja säännöksiä kuin normaaliin työmarkkinatukeen.
sv_se: På arbetsmarknadsstöd som betalas i form av integrationsstöd tillämpas samma bestämmelser som på normalt arbetsmarknadsstöd.

source: Edellytyksenä on toisin sanoen muun muassa se, että hänen voidaan katsoa asuvan Suomessa soveltamisalalain mukaisesti.
sv_se: Ett villkor är med andra ord bl.a. det att invandraren kan anses vara bosatt i Finland enligt tillämpningslagen.

source: Kotoutumisen edistämisestä annettua lakia valmisteltaessa haluttiin korostaa maahanmuuttajan omaa aktiivisuutta kotoutumisprosessissa, erityisesti kielen opiskelussa.
sv_se: Vid beredningen av integrationslagen ville man betona vikten av invandrarens egen aktivitet i integrationsprocessen, särskilt i fråga om språkstudier.

source: Lain 17 §:n 3 momenttiin otettiin tämän vuoksi säännös, jonka mukaan maahanmuuttajan on noudatettava suunnitelmaansa sekä hakeuduttava ja osallistuttava säännöllisesti kotoutumissuunnitelmaan sisältyvään suomen tai ruotsin kielen opetukseen ja muihin suunnitelmassa sovittuihin toimenpiteisiin ja palveluihin.
sv_se: I 17 § 3 mom. i lagen togs av denna anledning in en bestämmelse enligt vilken invandraren ska iaktta sin plan och söka sig till och regelbundet delta i den undervisning i finska eller svenska som ingår i integrationsplanen och i andra åtgärder och tjänster som överenskommits i planen.

source: Kotoutumiskoulutuksessa keskeinen osa on suomen tai ruotsin kielen oppimisella.
sv_se: Studierna i finska eller svenska utgör en central del av integrationsutbildningen.

source: Maahanmuuttajan kieltäytyessä ilman pätevää syytä osallistumasta kotoutumissuunnitelmassa yksilöidysti sovittuun toimenpiteeseen, hänen oikeuttaan kotoutumistukena maksettavaan etuuteen voidaan rajoittaa siten kuin työttömyysturvalaissa (1290/2002) säädetään tai alentaa siten kuin toimeentulotuesta annetussa laissa säädetään.
sv_se: Om invandraren utan giltig orsak vägrar att delta i en specifikt överenskommen åtgärd i integrationsplanen, kan hans och hennes rätt till en förmån som betalas som integrationsstöd begränsas enligt vad som föreskrivs i lagen om utkomstskydd för arbetslösa (1290/2002) eller sänkas enligt vad som föreskrivs i lagen om utkomststöd.

source: Sanktiot ovat vastaavia kuin työstä, työvoimapoliittisesta toimenpiteestä, aktivointisuunnitelman laadinnasta tai esimerkiksi kuntouttavasta työtoiminnasta kieltäydyttäessä.
sv_se: Påföljderna är motsvarande som vid vägran att ta emot arbete, delta i arbetskraftspolitiska åtgärder, i utarbetandet av en aktiveringsplan eller t.ex. i arbetsverksamhet i rehabiliteringssyfte.

source: Lienee perusteltua, että seuraamukset ovat ainakin joltain osin yhteismitallisia.
sv_se: Det torde vara motiverat att påföljderna åtminstone i någon mån är jämförbara.

source: Perustuslain 19 §:n 1 momentin mukaan jokaisella, joka ei kykene hankkimaan ihmisarvoisen elämän edellyttämää turvaa, on oikeus välttämättömään toimeentuloon ja huolenpitoon.
sv_se: Enligt 19 § 1 mom. i Finlands grundlag har alla som inte förmår skaffa sig den trygghet som behövs för ett människovärdigt liv rätt till oundgänglig försörjning och omsorg.

source: Oikeus koskee kaikkia ja sen tarkoituksena on turvata ihmisarvoisen elämän edellytysten vähimmäistaso (HE 309/1993 vp., s. 69/II).
sv_se: Denna rättighet gäller alla, och avsikten är att miniminivån på förutsättningarna för ett människovärdigt liv ska tryggas (RP 309/1993 rd, s. 69/II).

source: Säännöksellä jokaiselle on perustettu subjektiivinen oikeus, jolla on läheinen yhteys toimeentulotukeen.
sv_se: Genom bestämmelsen ges var och en subjektiv rätt som är nära kopplad till utkomststödet.

source: Perustuslakivaliokunta on muun muassa katsonut, että toimeentulotukea voidaan käytännössä pitää perustuslain 19 §:n 1 momentissa tarkoitetun ihmisarvoisen elämän edellyttämän välttämättömän toimeentulon ja huolenpidon takuuna siltä osin kuin turvaa annetaan rahamääräisinä suorituksina (PeVL 31/1997 vp, s. 2/II, PeVL 20/1998 vp, s. 2/II, PeVL 18/2001 vp, s. 4/I).
sv_se: Grundlagsutskottet har bland annat ansett att utkomststödet i praktiken kan betraktas som en garanti för den försörjning och omsorg som enligt 19 § 1 mom. i grundlagen krävs för ett människovärdigt liv i den mån stödet ges ut i pengar (GrUU 31/1997 rd, s. 2/II, GrUU 20/1998 rd, s. 2/II, GrUU 18/2001 rd, s. 4/I).

source: Perustuslain 19 §:n 1 momentin subjektiivisen oikeuden perustavasta luonteesta ja perustuslain 22 §:ssä julkiselle vallalle asetetusta perusoikeuksien turvaamisvelvoitteesta on kuitenkin johdettavissa lainsäätäjään kohdistuva velvoite järjestää tukijärjestelmä sellaiseksi, että yksilöillä on riittävät tosiasialliset mahdollisuudet päästä oikeuksiinsa (vrt. PeVL 31/1997 vp, s. 3/I).
sv_se: Lagstiftarnas skyldighet att se till att bidragssystemet är sådant att det ger individerna tillräckliga faktiska möjligheter att utöva sina rättigheter kan härledas ur den grundläggande karaktären hos den subjektiva rättigheten i 19 § 1 mom. i grundlagen och ur det allmännas skyldighet enligt grundlagens 22 § att se till att de grundläggande fri- och rättigheterna tillgodoses (jfr GrUU 31/1997 rd, s. 3/I).

source: Kotoutumissuunnitelmien edellytetään sisältävän kattavasti sellaisia toimenpiteitä, jotka edistävät kotoutumista ja soveltuvat yhteisesti sovittuun palvelukokonaisuuteen.
sv_se: Integrationsplanerna ska på ett heltäckande sätt innehålla integrationsfrämjande åtgärder som lämpar sig för en gemensamt överenskommen servicehelhet.

source: Keskeinen väline kotoutumista edistävien ja tukevien taitojen saavuttamiseksi on kotoutumiskoulutus, jota järjestetään sekä työvoimapoliittisena että omaehtoisena koulutuksena.
sv_se: Ett viktigt hjälpmedel för att färdigheter som främjar och stöder integration ska uppnås är den integrationsutbildning som ordnas både som arbetskraftspolitisk och som frivillig utbildning.

source: Kotoutumiskoulutuksesta ei ole ollut omaa erillislainsäädäntöä.
sv_se: Det finns inte någon särskild lagstiftning om integrationsutbildning.

source: Aikuisten kotoutumiskoulutus järjestetään pääasiassa työvoimapoliittisena aikuiskoulutuksena, josta säädetään julkisesta työvoimapalvelusta annetussa laissa (1295/2002).
sv_se: Integrationsutbildning för vuxna ordnas till övervägande del som arbetskraftspolitisk vuxenutbildning. Bestämmelser om arbetskraftspolitisk vuxenutbildning finns i lagen om offentlig arbetskraftsservice (1295/2002).

source: Kotoutumisen edistämisestä annettuun lakiin on otettu säännökset kotoutumiskoulutuksesta.
sv_se: I lagen om främjande av integration har det tagits in bestämmelser om integrationsutbildning.

source: Pääpaino koulutuksessa on kielen opiskelussa.
sv_se: Tyngdpunkten ligger på språkstudier.

source: Kotoutumiskoulutuksena voidaan järjestää myös omaehtoisena opiskeluna.
sv_se: Integrationsutbildning kan också ordnas i form av frivilliga studier.

source: Opintojen seurantaan sovelletaan, mitä julkisesta työvoimapalvelusta annetussa laissa säädetään.
sv_se: På uppföljning av studier tillämpas vad som föreskrivs i lagen om offentlig arbetskraftsservice.

source: Julkisen työvoimapalvelulain 9 luvun 6 §:n mukaan työnhakijan on osallistuttava säännöllisesti koulutus- tai opintosuunnitelman mukaiseen opetukseen.
sv_se: Enligt 9 kap. 6 § i lagen om offentlig arbetskraftsservice ska arbetssökanden regelbundet delta i undervisningen enligt utbildnings- eller studieplanen.

source: Työttömyysetuuden saamisen edellytyksenä on, että työnhakija etenee opinnoissaan.
sv_se: För att arbetssökanden ska få arbetslöshetsförmån förutsätts framsteg i studierna.

source: Korkeakouluopintojen katsotaan etenevän riittävästi, jos työnhakija saa tutkintoonsa kuuluvia opintosuorituksia keskimäärin 5,5 opintopistettä opiskelukuukautta kohti.
sv_se: Som tillräckliga framsteg i högskolestudier avses att arbetssökanden i genomsnitt får 5,5 studiepoäng per studiemånad för studieprestationer i anslutning till sin examen.

source: Muiden opintojen osalta edellytetään, että opinnot etenevät koulutus- tai opintosuunnitelmassa tarkoitetulla tavalla.
sv_se: I fråga om andra studier förutsätts det att studierna framskrider enligt utbildnings- eller studieplanen.

source: Mikäli maahanmuuttajan omaehtoisia opintoja ei tuettaisi enää työttömyysetuudella huonon opintomenestyksen takia, saisi hän jatkossakin edelleen kotoutumistukena maksettavaa työmarkkinatukea tai toimeentulotukea.
sv_se: Om invandrarens frivilliga studier inte längre stöds med arbetslöshetsförmån på grund av dålig studieframgång, kommer han eller hon även i fortsättningen fortfarande att få arbetsmarknadsstöd eller utkomststöd i form av integrationsstöd.

source: Kotoutumistuen saamisen edellytysten sitominen opintomenestykseen voisi saattaa kotoutumiskoulutuksessa olevat maahanmuuttajat eriarvoiseen asemaan, sillä maahanmuuttajien koulutustaustat eroavat varsin paljon toisistaan maahan tultaessa.
sv_se: Att binda villkoren för integrationsstöd till studieframgång kan försätta invandrarna inom integrationsutbildningen i en ojämlik ställning, eftersom det finns rätt stora skillnader i invandrarnas studiebakgrund när de anländer till landet.

source: Kyse on myös alkuvaiheessa monien maahanmuuttajien vähimmäistoimeentulosta riippumatta siitä maksetaanko kotoutumistuki työmarkkinatukena tai toimeentulotukena.
sv_se: Under den första tiden är det också för många invandrare oberoende av minimiutkomsten fråga om huruvida integrationsstödet betalas i form av arbetsmarknadsstöd eller utkomststöd.

source: Lähtökohtana henkilön vähimmäistoimeentulon sanktioinnissa tulee olla, ettei sanktiointi saa kuitenkaan vaarantaa ihmisarvoisen elämän edellyttämää turvaa eikä olla muutenkaan kohtuutonta.
sv_se: Utgångspunkten i fråga om sanktioner som gäller minimiutkomst ska vara att sanktionerna ändå inte får äventyra den trygghet som behövs för ett människovärdigt liv och inte heller i övrigt vara oskäliga.

source: Kotoutumiskoulutusta kehitettiin vuosina 2010–2013 Osallisena Suomessa
sv_se: Integrationsutbildningen utvecklades under 2010–2013 inom ramen för projektet Delaktig i Finland, och projektet styrs av bestämmelserna om försöket i 9 kap. i lagen om främjande av integration.

source: -hankkeen puitteissa, ja hanketta ohjaa lain kotoutumisen edistämisestä 9 luvun säännökset kokeilusta..
sv_se: I projektet utarbetades rekommendationer för utvecklandet av integrationsutbildningen som bedöms och i tillämpliga delar verkställs under nästa regeringsperiod.

source: Hankkeessa laadittiin kotoutumiskoulutuksen kehittämisestä suositukset, jotka arvioidaan ja soveltuvin osin täytäntöönpannaan seuraavalla hallituskaudella.
sv_se: Åtgärder och tjänster som främjar integration ordnas som en del av den kommunala basservicen och arbets- och näringsförvaltningens tjänster samt i form av andra åtgärder som främjar integration.

source: Kotoutumista edistäviä toimenpiteitä ja palveluja järjestetään osana kunnallisia peruspalveluja ja työ- ja elinkeinohallinnon palveluja sekä muina kotoutumista edistävinä toimenpiteinä.
sv_se: Arbets- och näringsbyråerna har huvudansvaret för rådgivning, vägledning och utbildning för de invandrare som är i arbetsför ålder och som står till arbetsmarknadens förfogande.

source: Päävastuu työikäisten ja työvoimaan kuuluvien maahanmuuttajien neuvonnasta, ohjauksesta ja koulutuksesta on työ- ja elinkeinotoimistoilla (TE toimisto), työvoimaan kuulumattomien maahanmuuttajien kotouttamispalvelujen järjestämisestä vastaavat kunnat.
sv_se: Kommunerna ansvarar för ordnandet av integrationstjänster för de invandrare som inte står till arbetsmarknadens förfogande.

source: Oppivelvollisuusiän ylittäneiden maahanmuuttajien kieli- ja yhteiskuntaan ohjaavaa koulutusta, kotoutumiskoulutusta järjestetään pääasiassa työvoimapoliittisena aikuiskoulutuksena, josta säädetään julkisesta työvoimapalvelusta annetussa laissa (1295/2002).
sv_se: För invandrare som passerat läropliktsåldern ordnas språk- och samhällsorienterande utbildning och integrationsutbildning i regel som arbetskraftspolitisk vuxenutbildning, om vilken det föreskrivs i lagen om offentlig arbetskraftsservice (1295/2002).

source: Maahanmuuttaja voi hakeutua myös opetushallinnon hallinnoimaan omaehtoiseen koulutukseen.
sv_se: Invandrare kan också söka sig till frivillig utbildning som administreras av utbildningsförvaltningen.

source: Maahanmuuttajien kotoutumiskoulutuksen sisältöä on kehitetty tiiviissä yhteistyössä Opetushallituksen kanssa ja sitä toteutetaan ”Aikuisten maahanmuuttajien kotoutumiskoulutus” -suosituksen mukaan.
sv_se: Innehållet i integrationsutbildningen för invandrare har utvecklats i nära samarbete med Utbildningsstyrelsen och genomförs i enlighet med rekommendationerna i ”Integrationsutbildningen för vuxna invandrare”.

source: Suositusta voidaan soveltaa työvoimapoliittiseen koulutukseen ja omaehtoisiin opintoihin.
sv_se: Rekommendationerna kan tillämpas på arbetskraftspolitisk utbildning och på frivilliga studier.

source: Suosituksen mukaan aikuisen maahanmuuttajan kotoutumiskoulutuksen tehtävänä on antaa aikuiselle maahanmuuttajalle sellaiset kielelliset, yhteiskunnalliset, kulttuuriset ja elämänhallintaan liittyvät valmiudet, joiden avulla hän pystyy selviytymään jokapäiväisen elämän tilanteissa uudessa ympäristössään, toimimaan työelämässä, hakeutumaan jatko-opintoihin sekä toimimaan suomalaisen kansalaisyhteiskunnan aktiivisena, täysivaltaisena ja tasaarvoisena jäsenenä.
sv_se: Enligt rekommendationerna ska integrationsutbildningen för vuxna invandrare ge sådana språkliga, samhälleliga, kulturella och med livskompetens förknippade färdigheter, med vilka invandraren klarar sig i det dagliga livets olika situationer i sin nya omgivning, förmår fungera i arbetslivet och söka sig till fortsatta studier, samt verka aktivt som fullvärdiga och jämlika medlemmar i det finländska medborgarsamhället.

source: Ennen varsinaista kotoutumiskoulutusta voidaan tarvittaessa järjestää luku- ja kirjoitustaidon opintoja.
sv_se: Före den egentliga integrationsutbildningen kan det vid behov ordnas läs- och skrivundervisning.
